<?php
/*
|--------------------------------------------------------------------------
| Guard
|--------------------------------------------------------------------------
|
| Валидация и провевка данных введенных через форму приложения
| или проверка еще чего-то, в общем здесь то, что за безопасность
|
*/
namespace vendor\src\Classes;

class Guard
{
    // список символов, которых удаляем
    public static $illegal = array(
        '<script>' => '',
        '</script>' => '',
        '-' => '-', // тире
        ':' => ':', // двоеточие
        '?' => '?', // вопросительный знак
        '!' => '!', // восклицательный знак
        '.' => '.', // точка
        ',' => ',', // запятая
        '\'' => '', //одиночная кавычка
        '"' => '', //двойная кавычка
        '--' => '',
        '—' => '',
        '_' => '',
        '__' => '',
        '‘' => '',
        '’' => '',
        '`' => '',
        '‚' => '',
        '„' => '',
        '“' => '',
        '”' => '',
        '«' => '',
        '»' => '',
        '<' => '',
        '>' => '',
        '\/' => '',
        '$' => '',
        '<?' => '',
        '*' => '',
        '^' => '',
        '~' => '',
        '{' => '',
        '}' => '',
        '#' => '',
        ';' => '',
        '&' => '',
        'f=' => '',
        '[' => '',
        ']' => '',
        '==' => '',
        '!=' => '',
        '===' => '',
        '|' => '',
        '«' => '',
        '»' => '',
        '%' => '',
        'quot' => '',
        'SELECT' => 'SEL_ECT',
        'INSERT' => 'INS_ERT',
        'UPDATE' => 'UPD_ATE',
        'DELETE' => 'DEL_ETE',
        'SCRIPT' => 'SCR_IPT'
    );
    
    /** 
    * Проверка введенных данных в input
    */
    public static function testInput($data) {
    $data = trim($data); // обрезаем если есть пробелы по краям
    $data = htmlspecialchars_decode($data); // если были js, то вернем их обратно. Дальшн preg_replace_callback их удалит совсем
    $pattern = '/^[\'\:\?\!\.\,\-\d\s\p{L}]+$/u'; // символы которые пропускаем  
    $result = preg_match($pattern, $data); // в результе 1 если все символы прошли или 0 если нет  
    if($result == 1){ // если по регулярке все символы прошли  
        $data = addslashes($data); // слэшируем ковычку  
    }  
    else{ // если есть символы невошедшие в регулярку, то обрабатываем данные основательно
        // удаляем js вместо него вставляем пустую строку или текст как здесь ' !- JS-SCRIPT -! ';
        $data = preg_replace_callback("'<script[^>]*?>.*?</script>'si", function($matches) {  
            return ' !- JS-SCRIPT -! ';
        }, $data); 
        // удаляем определенные в illegal символы
        foreach(self::$illegal as $key=>$value) {
            $data = str_replace ($key, $value, $data);
        }
    }  
    return $data;  
}
    
    /** 
    * Проверка E-Mail
    */
    public static function testE_Mail($data) {
        return filter_var($data, FILTER_VALIDATE_EMAIL);
    }
    
    /** 
    * Проверка булевых значений
    */
    public static function test_Bool($data) {
        if($i === 0 || $i === 1) {
            return $data;
        }
        else {
            return 0;
        }
    }
}